In [85]:
import numpy as np

In [86]:
import pandas as pd

In [87]:
###make a series from an array

arr = np.array([1, 2, 3, 4, 5, 6])
ser = pd.Series(arr)
ser

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int32

In [88]:
###arr = np.array([1, 2, 3, 4, 5, 6])
###ser = pd.Series(arr, index = ["A", "B", "C", "D", "E", "F"])
###ser

In [89]:
###make a series from a dictionary

dic = {"A": 1, "B": 2, "C": 3, "D": 4, "E": 5, "F": 6}
ser = pd.Series(dic)
ser

A    1
B    2
C    3
D    4
E    5
F    6
dtype: int64

In [90]:
###dic = {'A' : 1, 'B' : 2, 'C' : 3}
###ser = pd.Series(dic, index = ['B', 'C', 'D'])
###print(ser)

In [91]:
###dic = {'A' : 1, 'B' : 2, 'C' : 3}
###ser = pd.Series(dic, index = ['B', 'D', 'C', 'D'])
###ser

In [92]:
#make a dataframe from array

array = np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]])
index_values = ['first', 'second', 'third']
column_values = ['number', 'squares', 'cubes']
df = pd.DataFrame(data = array,
                 index = index_values,
                 columns = column_values)
df

        number  squares  cubes
first        1        2      3
second       4        5      6
third        7        8      9

In [93]:
#array = np.array([['Siddhi', 27], ['Sushil', 28], ['Himanshu', 26]])
#index_values = ['A', 'B', 'C']
#column_values = ['Name', 'Age']
#df = pd.DataFrame(data = array,
#                 index = index_values,
 #                columns = column_values)
#df

In [94]:
##adding third column
#array = np.array([['Siddhi', 27, 'November'], ['Sushil', 28, 'July'], ['Himanshu', 26, 'March'],['Kenisha', 28, 'September']])
#index_values = ['A', 'B', 'C', 'D']
#column_values = ['Name', 'Age', 'Birth_Month']
#df = pd.DataFrame(data = array,
 #                index = index_values,
 #                columns = column_values)
#df

In [95]:
###make a DataFrame from an dictionary

data = {
    'cloths' : ['Jeans', 'Tops', 'Shirt'],
    'color' : ['Blue', 'Black', 'White'],
    'size' : ['L', 'S', 'XL']
}
df = pd.DataFrame(data)
df

  cloths  color size
0  Jeans   Blue    L
1   Tops  Black    S
2  Shirt  White   XL

In [96]:
### with index

###data = {
###    'cloths' : ['Jeans', 'Top', 'Shirt'],
###    'color' : ['Blue', 'Black', 'White'],
###    'size' : ['L', 'S', 'XL']
###}
##df = pd.DataFrame(data, index = ["my_cloths", "fav_color", "my_size"])
##df

In [97]:
#data = {
 #  'Siddhi' : 27,
  #  'Heer' : 12,
   # 'Aahan' : 4
#}
#df = pd.DataFrame(list(data.items()))
#df

In [98]:
#required columns only

#data = {
 #   'cloths' : ['Jeans', 'Tops', 'Shirt'],
  #'color' : ['Blue', 'Black', 'White'],
   # 'size' : ['L', 'S', 'XL']
#}
#df = pd.DataFrame(data, columns = ['cloths', 'color'])
#df

In [99]:
data = {
    'Name of Students' : ['Siddhi', 'Heli', 'Disha', 'Ritik', 'Deepak', 'Abhinav', 'Urvish', 'Kenisha','Pinal', 'Heeral'],
    'Course Name' : ['DS', 'DA', 'Python', 'DS', 'DA','Python', 'Python', 'DS', 'DS', 'DA'],
    'Total Marks' : [77, 80, 93, 79, 83, 66, 59, 87, 47, 55]
}
df = pd.DataFrame(data)
df

  Name of Students Course Name  Total Marks
0           Siddhi          DS           77
1             Heli          DA           80
2            Disha      Python           93
3            Ritik          DS           79
4           Deepak          DA           83
5          Abhinav      Python           66
6           Urvish      Python           59
7          Kenisha          DS           87
8            Pinal          DS           47
9           Heeral          DA           55

In [100]:
data = {
    'Name of Students' : ['Siddhi', 'Heli', 'Disha', 'Ritik', 'Deepak'],
    'Course Name' : ['DS', 'DA', 'Python', 'DS', 'DA'],
    'Total Marks' : [77, 80, 93, 79, 83]
}
df = pd.DataFrame(data, index = ['A', 'B', 'C', 'D', 'E'])
df

  Name of Students Course Name  Total Marks
A           Siddhi          DS           77
B             Heli          DA           80
C            Disha      Python           93
D            Ritik          DS           79
E           Deepak          DA           83

In [101]:
###df = pd.DataFrame(data, index = 'I','II', 'III', 'IV', 'V', 'VI', 'VII', 'VIII', 'IX', 'X')
####df = pd.DataFrame(data, index = ['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J'])

In [137]:
df[["Total Marks"]]

   Total Marks
A           77
B           80
C           93
D           79
E           83
F           77
G           91
H           97

In [103]:
print(df[["Name of Students","Total Marks"]])

  Name of Students  Total Marks
A           Siddhi           77
B             Heli           80
C            Disha           93
D            Ritik           79
E           Deepak           83

In [104]:
df[1:4]

  Name of Students Course Name  Total Marks
B             Heli          DA           80
C            Disha      Python           93
D            Ritik          DS           79

In [105]:
df[2:3]

  Name of Students Course Name  Total Marks
C            Disha      Python           93

In [106]:
df[1:3]

  Name of Students Course Name  Total Marks
B             Heli          DA           80
C            Disha      Python           93

In [107]:
df[:2:]

  Name of Students Course Name  Total Marks
A           Siddhi          DS           77
B             Heli          DA           80

In [108]:
import numpy as np
data = {
    'Name of Students' : ['Siddhi', 'Heli', 'Disha', 'Ritik', 'Deepak'],
    'Course Name' : ["Data Science", 'Data Analytics', 'Python', 'Data Science', 'Data Analytics'],
    'Total Marks' : [ 77, 80, 93, 79, 83]
    
}
df = pd.DataFrame(data, index = ['A', 'B', 'C', 'D', 'E'])
df

  Name of Students     Course Name  Total Marks
A           Siddhi    Data Science           77
B             Heli  Data Analytics           80
C            Disha          Python           93
D            Ritik    Data Science           79
E           Deepak  Data Analytics           83

In [109]:
df.loc['F'] = ['Janu', 'Data Science', 77]

In [110]:
df.loc['G'] = ['Dhruv', np.nan, 91]

In [111]:
df.loc['H'] = ['Dipti', 'DA', 97]

In [112]:
df

  Name of Students     Course Name  Total Marks
A           Siddhi    Data Science           77
B             Heli  Data Analytics           80
C            Disha          Python           93
D            Ritik    Data Science           79
E           Deepak  Data Analytics           83
F             Janu    Data Science           77
G            Dhruv             NaN           91
H            Dipti              DA           97

In [113]:
##df['DOJ'] = ['a', 'b', 'c', 'd', 'e', 'f', 'g']

In [114]:
df

  Name of Students     Course Name  Total Marks
A           Siddhi    Data Science           77
B             Heli  Data Analytics           80
C            Disha          Python           93
D            Ritik    Data Science           79
E           Deepak  Data Analytics           83
F             Janu    Data Science           77
G            Dhruv             NaN           91
H            Dipti              DA           97

In [115]:
###df = df.drop(['DOJ'], axis = 1)

In [116]:
ag = [20, 22, 24, 27, 17, 12, 10, 25]
df['Age'] = ag
df

  Name of Students     Course Name  Total Marks  Age
A           Siddhi    Data Science           77   20
B             Heli  Data Analytics           80   22
C            Disha          Python           93   24
D            Ritik    Data Science           79   27
E           Deepak  Data Analytics           83   17
F             Janu    Data Science           77   12
G            Dhruv             NaN           91   10
H            Dipti              DA           97   25

In [117]:
df

  Name of Students     Course Name  Total Marks  Age
A           Siddhi    Data Science           77   20
B             Heli  Data Analytics           80   22
C            Disha          Python           93   24
D            Ritik    Data Science           79   27
E           Deepak  Data Analytics           83   17
F             Janu    Data Science           77   12
G            Dhruv             NaN           91   10
H            Dipti              DA           97   25

In [130]:
df['Age']>20

A    False
B     True
C     True
D     True
E    False
F    False
G    False
H     True
Name: Age, dtype: bool

In [132]:
df[df['Age']>20]

  Name of Students     Course Name  Total Marks  Age
B             Heli  Data Analytics           80   22
C            Disha          Python           93   24
D            Ritik    Data Science           79   27
H            Dipti              DA           97   25

In [118]:
##df.drop(['DOJ'], axis=1,inplace = True)

In [119]:
df[['Name of Students', 'Course Name', 'Total Marks']].loc['B': 'F']

  Name of Students     Course Name  Total Marks
B             Heli  Data Analytics           80
C            Disha          Python           93
D            Ritik    Data Science           79
E           Deepak  Data Analytics           83
F             Janu    Data Science           77

In [140]:
df['Name of Students'].loc['B': 'E']

B      Heli
C     Disha
D     Ritik
E    Deepak
Name: Name of Students, dtype: object

In [121]:
df.loc[['B', 'E']]  ##select only b and e

  Name of Students     Course Name  Total Marks  Age
B             Heli  Data Analytics           80   22
E           Deepak  Data Analytics           83   17

In [122]:
df['Total Marks']>80

A    False
B    False
C     True
D    False
E     True
F    False
G     True
H     True
Name: Total Marks, dtype: bool

In [138]:
df.loc['C']

Name of Students     Disha
Course Name         Python
Total Marks             93
Age                     24
Name: C, dtype: object

In [123]:
df[df['Total Marks']>80]

  Name of Students     Course Name  Total Marks  Age
C            Disha          Python           93   24
E           Deepak  Data Analytics           83   17
G            Dhruv             NaN           91   10
H            Dipti              DA           97   25

In [124]:
df['Total Marks']

A    77
B    80
C    93
D    79
E    83
F    77
G    91
H    97
Name: Total Marks, dtype: int64

In [135]:
df[df['Course Name'] == 'Data Science']

  Name of Students   Course Name  Total Marks  Age
A           Siddhi  Data Science           77   20
D            Ritik  Data Science           79   27
F             Janu  Data Science           77   12

In [136]:
df[df['Course Name'] == 'Python']

  Name of Students Course Name  Total Marks  Age
C            Disha      Python           93   24

#

In [126]:
import pandas as pd

In [127]:
df1 = pd.read_excel('pandasss.xlsx')

In [128]:
df1

   col1  col2
0     1    45
1     2    54
2     3     7
3     4     8
4     5    45
5     6    98
6     7    77
7     8    52
8     9    98
9    10    45

In [129]:
df = pd.read_excel(C:\Users\siddh\Downloads\numpy.xlsx')
                   df

SyntaxError: invalid syntax (Temp/ipykernel_12376/3669562076.py, line 1)

##

In [75]:
C:\Users\siddh\Downloads

SyntaxError: unexpected character after line continuation character (Temp/ipykernel_12376/3865253746.py, line 1)

# Operator